app/controllers/pets_controller.rb

  def index
    @pets = Pet.where(user_id: params[:user_id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."user_id" = $1  [["user_id", 2]]

  def show
        @pet= Pet.find_by(id: params[:id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]