app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."pet_id" IS NULL
---
  def index
    @posts = Post.where(pet_id: params[:pet_id])